{
  "__version__": "1.2.0",
  "_name_or_path": "output/sick_sts_mednlisim_medsts_defs4b_medcycle1_stamb-2023-09-17_20-30-20/0_Transformer/",
  "architectures": [
    "MPNetModel"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "mpnet",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_hidden_states": true,
  "pad_token_id": 1,
  "relative_attention_num_buckets": 32,
  "transformers_version": "4.2.2",
  "vocab_size": 30527
}
